<!DOCTYPE html>
<html lang="en">
  <head>
    <meta charset="iso-8859-1" />
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <meta name="description" content="Jdash">
    <meta name="author" content="">
    <link rel="icon" href="ressources/favicon.ico">

    <title>Jdash</title>
    
      <link href="../css/bootstrap.min.css" rel="stylesheet" />
      <link href="../css/justified-nav.css" rel="stylesheet" />
      <link href="../css/jdash.css" rel="stylesheet" />
    
  </head>
  <body>

    <div class="container">
        <!-- CONNEXION BAAAAR -->
      <div class="masthead">
        <nav>
          <ul class="nav nav-justified">
            <li><a href="Accueil.html">Accueil</a></li>
            <li class="active"><a href="jdash.html">Jdash</a></li>
            <li><a href="inscription.html">S'inscrire</a></li>
            <li><a href="connexion.html">Se connecter</a></li>
            <li><a href="download.html">Downloads</a></li>
            <li><a href="plugin.html">Les plug-ins</a></li>
            <li><a href="contact.html">Contact</a></li>
          </ul>
        </nav>
      </div>
        <!-- CONNEXION BAAAAR -->



      <!-- Jumbotron -->
      <div class="jumbotron" style="background-color:whitesmoke;">
        
          <h3><u>Qu'est ce que Jdash?</u></h3>
          <hr />
    <p>
        <h4><u><em>Pr&eacute;sentation</em></u></h4>

Notre projet Jdash, est un projet qui a &eacute;t&eacute; d&eacute;velopp&eacute; dans le but de proposer à son utilisateur un outil lui permettant de regrouper diff&eacute;rentes 
        sources d’informations et/ou applications dont il pourrait avoir besoin dans un seul ensemble.<br /><br />
        L’application se présentera comme un Dashboard.
        <img src="../images/i1.png" />
        <br />
        
Une interface de ce type permet de regrouper ais&eacute;ment et agr&eacute;ablement les diff&eacute;rentes sources/types d’informations que l’utilisateur consulte r&eacute;gulièrement.
Toutes les applications seront r&eacute;alis&eacute;es et ex&eacute;cut&eacute;es en Java.<br /><br /> Certaines utiliserons des API propri&eacute;taires (Facebook, Twitter, …).<br /><br />
Jdash contiendra par défaut certaines fonctionnalités, comme un launcher d’applications pr&eacute;sentes sur la machine hôte.

        <h4><u><em>Ou le t&eacute;l&eacute;charger?</em></u></h4>

        L'application Jdash est disponible dans l'onglet "Download" au dessus du site, tout visiteur du site ainsi que les membres inscris sur le site peuvent la t&eacute;l&eacute;charger à volont&eacute;.
        <br /><br /> L'application sera donc disponible en téléchargement sous ses différentes versions
    </p>

    <p>
        <h4>Descriptif Fonctionnel</h4>

    <ul>
        <li>Application lourde Java 
            <br />
            <br />
            L’application utilisera des « tuiles » dans lesquelles l’utilisateur pourra int&eacute;grer un des plugins pr&eacute;c&eacute;demment t&eacute;l&eacute;charg&eacute;s.<br /><br />
            L’utilisateur pourra rajouter/supprimer/d&eacute;placer et modifier (couleur de fond, taille par d&eacute;faut, …) des tuiles dans lesquelles il pourra ajouter les plug-ins d&eacute;sir&eacute;s.<br /><br />
            Par défaut Jdash proposera 3 plug-ins affich&eacute;s (horloge, post-it, calculatrice) et deux autres d&eacute;jà install&eacute;s Flux RSS, calendrier. Le reste du catalogue sera disponible via l’interface web.
        </li>
    </ul>
        </p>

    <p><h4>Quel est l'intérêt de Jdash?</h4>

        L'int&eacute;rêt de Jdash est que chaque utilisateur peut contribuer à son l'&eacute;volution. Si vous êtes un développeur en java et que vous avez de petites applications que vous souhaitez partager avec 
        la communaut&eacute;, Jdash est donc l'application qu'il vous faut car chaque utilisateur peut poster des plug-ins à volont&eacute;.
    </p>
      </div>


    </div> <!-- /container -->


    <!-- IE10 viewport hack for Surface/desktop Windows 8 bug -->
    <script src="../../assets/js/ie10-viewport-bug-workaround.js"></script>
  </body>
</html>